import 'package:flutter/material.dart';
import 'package:mudad_app/app_constants/app_assets.dart';
import 'package:mudad_app/app_constants/app_text_styles.dart';

class VisionPage extends StatelessWidget {
  const VisionPage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        body: Container(
          padding: const EdgeInsets.symmetric(horizontal: 50),
          width: double.infinity,
          decoration: const BoxDecoration(
              image: DecorationImage(
                  image: AssetImage(AppAssets.backGround), fit: BoxFit.fill)),
          child: Column(
            mainAxisAlignment: MainAxisAlignment.spaceEvenly,
            // crossAxisAlignment: CrossAxisAlignment.end,
            children: [
              Column(
                children: [
                  Image.asset(AppAssets.appLogo,height: 100,),

                  FittedBox(
                      child: Text(
                        "{وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ أَفَلَا يُؤْمِنُونَ}",
                        style: AppTextStyle.quranFont,
                      )),
                ],
              ),
              Expanded(
                child: Padding(
                  padding: const EdgeInsets.symmetric(vertical: 20.0),
                  child: ListView(
                    physics: const BouncingScrollPhysics(),
                    children: const [
                      Text(
                        'الشروط والأحكام لتطبيق "مدد"\n'
                            '1. البنود العامة:\n'
                            'قبل استخدام تطبيق "مدد" وتسجيل عضويتك، يتعين عليك قراءة والموافقة على اتفاقية المستخدم وسياسة الخصوصية المرتبطة به. يتعين أيضًا عليك قراءة جميع الشروط والأحكام المتعلقة بالخدمة من خلال الروابط الخاصة بالتطبيق.\n'
                            '2. شروط العضوية:\n'
                            'تُمنح عضوية التطبيق للأفراد الذين تجاوزوا سن الـ 15 عامًا. يتعين عليك تقديم إثبات عمرك لتفعيل حسابك. يحتفظ التطبيق بحقه في إلغاء حساب أي عضو دون سابق إنذار إذا لم يكن قد تجاوز سن الـ 15 عامًا.\n'
                            '3. جمع البيانات الشخصية:\n'
                            'عند تصفح التطبيق، لا يتم جمع أي بيانات شخصية حتى يتم استخدام الخدمة. عند الاستخدام، يتم جمع البيانات الشخصية مثل الاسم، البريد الإلكتروني، رقم الجوال، والموقع.\n'
                            '4. استخدام البيانات الشخصية:\n'
                            'يتم استخدام البيانات الشخصية لأغراض مثل التسجيل في التطبيق، تخصيص تجربتك، تحديد وقت التوصيل، وتلقي العروض الترويجية.\n'
                            '5. معالجة الدفع الإلكتروني:\n'
                            'يتم استخدام طرف ثالث موثوق لمعالجة عمليات الدفع الإلكتروني. يُطلب من هذا الطرف الثالث معلومات بطاقة الائتمان لإتمام عملية الدفع.\n'
                            '6. مشاركة البيانات الشخصية:\n'
                            'لا نبيع أو نشارك البيانات الشخصية مع أي طرف ثالث لأي غرض.\n'
                            '7. أمان البيانات الشخصية:\n'
                            'يتم استخدام تقنيات أمان متقدمة للحفاظ على خصوصية البيانات الشخصية. لكن "مدد" لا تتحمل مسؤولية أي انتهاكات أمنية تحدث من خلال جهاز المستخدم.\n'
                            '8. تحديثات وتغييرات في الشروط والأحكام:\n'
                            'نحتفظ بالحق في إجراء تحديثات على شروط الاستخدام وسياسة الخصوصية بدون إشعار مُسبق. يُطلب من المستخدمين مراجعة الشروط بشكل دوري لمتابعة التغييرات.\n'
                            '9. إلغاء الحساب:\n'
                            'يُحظر استخدام التطبيق لأي مستخدم دون توفره للمعلومات المطلوبة. يحتفظ التطبيق بالحق في إلغاء حسابات غير مؤكدة أو غير موثقة أو الحسابات الغير نشطة لفترة طويلة.\n'
                            '10. التعامل مع الحسابات الغير ملكية:\n'
                            'يُمنع استخدام حسابات لا تعود ملكيتها للفرد المستخدم. في حال اكتشاف حساب غير ملكي، يحق لتطبيق "مدد" إلغاء هذا الحساب دون إشعار مسبق وتحميل المستخدم المسؤولية.\n'
                            '11. التزام المستخدم بالإشعارات:\n'
                            'يجب على المستخدم تحديث معلوماته الشخصية بشكل دوري والموافقة على تلقي الإشعارات المتعلقة بالتطبيق، بما في ذلك العروض الترويجية والتحديثات.\n'
                            '12. الامتثال للتشريعات المحلية والقوانين:\n'
                            'يُلزم المستخدم بالامتثال لجميع التشريعات والقوانين المحلية المتعلقة بالاستخدام الإلكتروني والتجارة الإلكترونية.\n'
                            '13. الشروط المحددة للمؤسسات التجارية:\n'
                            'في حالة التسجيل نيابةً عن مؤسسة تجارية، يجب أن يكون المستخدم قادرًا على التصرف نيابةً عن هذه المؤسسة والامتثال لشروط الاتفاقية.\n'
                            '14. التعديلات في سياسة الخصوصية:\n'
                            'يحتفظ تطبيق "مدد" بحق تحديث سياسة الخصوصية في أي وقت دون إشعار مسبق. يتعين على المستخدم مراجعة السياسة بشكل دوري للتأكد من فهم أحدث التحديثات.\n'
                            '15. المسؤولية عن الأمان الشخصي:\n'
                            'يتحمل المستخدم مسؤولية تأمين حسابه الشخصي وتجنب مشاركة بيانات الدخول مع الآخرين. تفرض تطبيق "مدد" على المستخدم إعلامهم فور اكتشاف أي استخدام غير مصرح به لحسابهم.\n'
                            '16. الإلغاء والتعليق:\n'
                            'يحق لتطبيق "مدد" إلغاء أو تعليق أي حساب في حالة انتهاك أي من الشروط المذكورة أعلاه أو تورط المستخدم في أنشطة تعتبر غير قانونية.\n'
                            'تسعى "مدد" إلى توفير تجربة مأمونة وفعّالة للمستخدمين. يُطلب من المستخدم قراءة هذه الشروط والأحكام بعناية وفهمها بشكل كامل قبل استخدام التطبيق.\n',
                        textAlign: TextAlign.start,
                        textDirection: TextDirection.rtl,
                        style: TextStyle(fontSize: 16.0,fontWeight: FontWeight.w600),
                      ),
                    ],
                  ),
                ),
              )
            ],
          ),
        ),
      ),
    );
  }
}
